#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.main.data.http.ssh_keys: Reading...
module.main.data.http.ssh_keys: Read complete after 1s [id=https://github.com/browniebroke.keys]
module.main.aws_iam_role.ecs-host-role: Refreshing state... [id=ecs_host_role_prod]
module.main.aws_key_pair.production: Refreshing state... [id=production_key_pair]
module.main.aws_cloudwatch_log_group.django-log-group: Refreshing state... [id=/ecs/myapp]
module.main.aws_ecs_cluster.production: Refreshing state... [id=arn:aws:ecs:eu-west-2:111579726218:cluster/production-cluster]
module.main.aws_vpc.production-vpc: Refreshing state... [id=vpc-0d81564eaa594ca38]
module.main.aws_ecr_repository.app_ecr_repo: Refreshing state... [id=myapp]
module.main.aws_iam_role.ecs-service-role: Refreshing state... [id=ecs_service_role_prod]
module.main.aws_iam_role_policy.ecs-service-role-policy: Refreshing state... [id=ecs_service_role_prod:ecs_service_role_policy]
module.main.aws_iam_instance_profile.ecs: Refreshing state... [id=ecs_instance_profile_prod]
module.main.aws_iam_role_policy.ecs-instance-role-policy: Refreshing state... [id=ecs_host_role_prod:ecs_instance_role_policy]
module.main.aws_cloudwatch_log_stream.django-log-stream: Refreshing state... [id=myapp-log-stream]
module.main.aws_subnet.private-subnet-2: Refreshing state... [id=subnet-0885ab64f53876dea]
module.main.aws_alb_target_group.default-target-group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:111579726218:targetgroup/production-tg/87ab9a57ea5c1917]
module.main.aws_subnet.private-subnet-1: Refreshing state... [id=subnet-0b7e7370180d1330e]
module.main.aws_subnet.public-subnet-2: Refreshing state... [id=subnet-08f07f5c848e74bf2]
module.main.aws_route_table.public-route-table: Refreshing state... [id=rtb-0e5e332f3554afd52]
module.main.aws_route_table.private-route-table: Refreshing state... [id=rtb-00c5532ff7b0e8b77]
module.main.aws_subnet.public-subnet-1: Refreshing state... [id=subnet-0b941ea2876dd8206]
module.main.aws_internet_gateway.production-igw: Refreshing state... [id=igw-0e1b36fc71216e447]
module.main.aws_security_group.load-balancer: Refreshing state... [id=sg-0fc25c88d90955847]
module.main.aws_eip.elastic-ip-for-nat-gw: Refreshing state... [id=eipalloc-0296fe061bbc7967e]
module.main.aws_route_table_association.private-route-1-association: Refreshing state... [id=rtbassoc-0c844950c91aa67ce]
module.main.aws_route_table_association.private-route-2-association: Refreshing state... [id=rtbassoc-0a954648d147471e7]
module.main.aws_security_group.ecs: Refreshing state... [id=sg-0851edd013e68d0f9]
module.main.aws_lb.production: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:111579726218:loadbalancer/app/production-alb/f8f32ef8ad02d30d]
module.main.aws_route_table_association.public-route-1-association: Refreshing state... [id=rtbassoc-07c1e6ec69b6a785a]
module.main.aws_route.public-internet-igw-route: Refreshing state... [id=r-rtb-0e5e332f3554afd521080289494]
module.main.aws_route_table_association.public-route-2-association: Refreshing state... [id=rtbassoc-081901621cf794c22]
module.main.aws_launch_configuration.ecs: Refreshing state... [id=production-cluster]
module.main.aws_nat_gateway.nat-gw: Refreshing state... [id=nat-0ad42057fff432dd9]
module.main.aws_ecs_task_definition.app: Refreshing state... [id=myapp-task]
module.main.aws_route.nat-gw-route: Refreshing state... [id=r-rtb-00c5532ff7b0e8b771080289494]
module.main.aws_alb_listener.ecs-alb-http-listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:111579726218:listener/app/production-alb/f8f32ef8ad02d30d/17ba6f18a6c4b7c3]
module.main.aws_autoscaling_group.ecs-cluster: Refreshing state... [id=production_auto_scaling_group]
module.main.aws_ecs_service.production: Refreshing state... [id=arn:aws:ecs:eu-west-2:111579726218:service/production-cluster/production-myapp-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.main.aws_db_instance.production will be created
  + resource "aws_db_instance" "production" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "myapp-db"
      + db_subnet_group_name                  = "main"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "15.2"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "production"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = false
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp2"
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "myapp"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.main.aws_db_subnet_group.production will be created
  + resource "aws_db_subnet_group" "production" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "main"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-0885ab64f53876dea",
          + "subnet-0b7e7370180d1330e",
        ]
      + supported_network_types = (known after apply)
      + tags_all                = (known after apply)
    }

  # module.main.aws_ecs_service.production will be updated in-place
  ~ resource "aws_ecs_service" "production" {
        id                                 = "arn:aws:ecs:eu-west-2:111579726218:service/production-cluster/production-myapp-service"
        name                               = "production-myapp-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-2:111579726218:task-definition/myapp-task:2" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.main.aws_ecs_task_definition.app must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
      ~ arn                      = "arn:aws:ecs:eu-west-2:111579726218:task-definition/myapp-task:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-2:111579726218:task-definition/myapp-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 10
                  - environment      = []
                  - essential        = true
                  - image            = "nginx:latest"
                  - links            = []
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/myapp"
                          - awslogs-region        = "eu-west-2"
                          - awslogs-stream-prefix = "myapp-log-stream"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = []
                  - name             = "myapp-container"
                  - portMappings     = [
                      - {
                          - containerPort = 80
                          - hostPort      = 0
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply)
      ~ id                       = "myapp-task" -> (known after apply)
      + network_mode             = (known after apply)
      - requires_compatibilities = [] -> null
      ~ revision                 = 2 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.main.aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "Allows inbound access from ECS only"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0851edd013e68d0f9",
                ]
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = "rds-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0d81564eaa594ca38"
    }

Plan: 4 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>